app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."state" = $2  [["user_id", 1], ["state", "to_do"]]
---
  def index
    @to_do = current_user.tasks.where(state: "to_do")

INSERT INTO "tasks" ("content", "created_at", "state", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hello"], ["created_at", "2014-10-13 18:19:59.574221"], ["state", "to_do"], ["updated_at", "2014-10-13 18:19:59.574221"], ["user_id", 1]]
---
  def create
    @task = current_user.tasks.new(task_params)
    @task.save

UPDATE "tasks" SET "content" = $1, "updated_at" = $2 WHERE "tasks"."id" = 1  [["content", "Hello Motherfucker"], ["updated_at", "2014-10-16 02:14:36.731718"]]
---
  def update
    @task.update(task_params)

UPDATE "tasks" SET "state" = $1, "updated_at" = $2 WHERE "tasks"."id" = 1  [["state", "doing"], ["updated_at", "2014-10-13 18:20:03.139849"]]
---
  def doing
    @task.update_attributes(state: "doing")

UPDATE "tasks" SET "state" = $1, "updated_at" = $2 WHERE "tasks"."id" = 1  [["state", "done"], ["updated_at", "2014-10-13 18:20:05.468340"]]
---
  def done
    @task.update_attributes(state: "done")

UPDATE "tasks" SET "state" = $1, "updated_at" = $2 WHERE "tasks"."id" = 1  [["state", "to_do"], ["updated_at", "2014-10-13 18:20:10.791418"]]
---
  def todo
    @task.update_attributes(state: "to_do")